; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v8 - type_3 ?v3 - type_1)
 	      (pred_3 ?v1 - object ?v3 - type_1)
	      (pred_4 ?v8 - type_3 ?v6 - type_2)
	      (pred_1 ?v8 - type_3 ?v1 - object ?v6 - type_2))

   (:action op_3
       :parameters  (?v8 - type_3 ?v4 ?v5 - type_1)
       :precondition (and  (pred_2 ?v8 ?v4))
       :effect (and  (pred_2 ?v8 ?v5)
		     (not (pred_2 ?v8 ?v4))))

   (:action op_1
       :parameters (?v8 - type_3 ?v7 - object ?v2 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v2) (pred_2 ?v8 ?v2) (pred_4 ?v8 ?v6))
       :effect (and (pred_1 ?v8 ?v7 ?v6)
		    (not (pred_3 ?v7 ?v2)) 
		    (not (pred_4 ?v8 ?v6))))

   (:action op_2
       :parameters (?v8 - type_3 ?v7 - object ?v2 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v8 ?v7 ?v6) (pred_2 ?v8 ?v2))
       :effect (and (pred_3 ?v7 ?v2)
		    (pred_4 ?v8 ?v6)
		    (not (pred_1 ?v8 ?v7 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_07 obj_06 - type_3
obj_13 obj_09 obj_10 obj_05 - type_2
obj_02 obj_12 obj_01 obj_11 - type_1
obj_03 obj_04 obj_08 - object)
(:init
(pred_2 obj_07 obj_12)
(pred_4 obj_07 obj_13)
(pred_4 obj_07 obj_09)
(pred_2 obj_06 obj_11)
(pred_4 obj_06 obj_10)
(pred_4 obj_06 obj_05)
(pred_3 obj_03 obj_02)
(pred_3 obj_04 obj_12)
(pred_3 obj_08 obj_11)
)
(:goal
(and
(pred_3 obj_03 obj_11)
(pred_3 obj_04 obj_11)
(pred_3 obj_08 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_07 obj_02) (pred_2 obj_06 obj_02))))
    (always (not (and (pred_2 obj_07 obj_11) (pred_2 obj_06 obj_11))))
  )
)
)

; plan
1. (op_1 obj_06 obj_08 obj_11 obj_05)
   deleted: (pred_3 obj_08 obj_11) (pred_4 obj_06 obj_05)
   added: (pred_1 obj_06 obj_08 obj_05)
   goals met: 0 of 3
2. (op_1 obj_07 obj_04 obj_12 obj_09)
   deleted: (pred_3 obj_04 obj_12) (pred_4 obj_07 obj_09)
   added: (pred_1 obj_07 obj_04 obj_09)
   goals met: 0 of 3
3. (op_3 obj_06 obj_11 obj_12)
   deleted: (pred_2 obj_06 obj_11)
   added: (pred_2 obj_06 obj_12)
   goals met: 0 of 3
4. (op_3 obj_07 obj_12 obj_02)
   deleted: (pred_2 obj_07 obj_12)
   added: (pred_2 obj_07 obj_02)
   goals met: 0 of 3
5. (op_2 obj_06 obj_08 obj_12 obj_05)
   deleted: (pred_1 obj_06 obj_08 obj_05)
   added: (pred_3 obj_08 obj_12) (pred_4 obj_06 obj_05)
   goals met: 1 of 3
6. (op_1 obj_07 obj_03 obj_02 obj_13)
   deleted: (pred_3 obj_03 obj_02) (pred_4 obj_07 obj_13)
   added: (pred_1 obj_07 obj_03 obj_13)
   goals met: 1 of 3
7. (op_3 obj_07 obj_02 obj_11)
   deleted: (pred_2 obj_07 obj_02)
   added: (pred_2 obj_07 obj_11)
   goals met: 1 of 3
8. (op_2 obj_07 obj_04 obj_11 obj_09)
   deleted: (pred_1 obj_07 obj_04 obj_09)
   added: (pred_3 obj_04 obj_11) (pred_4 obj_07 obj_09)
   goals met: 2 of 3
9. (op_2 obj_07 obj_03 obj_11 obj_13)
   deleted: (pred_1 obj_07 obj_03 obj_13)
   added: (pred_3 obj_03 obj_11) (pred_4 obj_07 obj_13)
   goals met: 3 of 3
